module PositionsHelper
  
  def consultant_list
    list = []
    User.where(isadmin: true).each do |a|
      list << a.name
    end
    return list
  end
  
  def education_list
    ['学历不限', '初中及以上', '高中及以上', '大专及以上', '本科及以上', '硕士及以上', '博士及以上']
  end
  
  def experience_list
    ['经验不限', '1年以上', '3年以上', '5年以上', '8年以上', '15年以上']
  end
  
  # Not used
  def district_list
    {beijing: ['东城区', '西城区', '海淀区', '朝阳区', '丰台区', '石景山区', '通州区', '顺义区', '房山区', '大兴区', '昌平区', '怀柔区', '平谷区', '门头沟区', '密云区', '延庆区'], shanghai: ['黄浦区', '浦东新区', '徐汇区', '长宁区', '静安区', '普陀区', '闸北区', '虹口区', '杨浦区', '闵行区', '宝山区', '嘉定区', '金山区', '松江区', '青浦区', '奉贤区', '崇明县'], shenzhen: ['福田区', '罗湖区', '南山区', '盐田区', '宝安区', '龙岗区', '光明新区', '龙华新区', '坪山新区', '大鹏新区'], guangzhou: ['越秀区', '荔湾区', '海珠区', '天河区', '白云区', '黄浦区', '番禺区', '花都区', '南沙区', '增城区', '从化区']}
  end
end
